# Taps
tap "armmbed/formulae"
tap "azure/functions"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "nwhetsell/lilypond"
tap "osx-cross/avr"
tap "railwaycat/emacsmacport"
tap "shivammathur/php"
tap "clojure/tools"
tap "clojure-lsp/brew"
tap "coursier/formulas"
tap "borkdude/brew"
tap "babashka/brew"
tap "borkdude/brew"
tap "isen-ng/dotnet-sdk-versions"
tap "omnisharp/omnisharp-roslyn"
tap "sscotth/monoid"

# Other package managers
brew "whalebrew"    # brew, but for docker
brew "mas"          # brew, but for the AppStore
brew "opam"         # packages manager for ocaml
brew "pyenv"        # python installer
brew "tfenv"
brew "rbenv"
brew "luaver"
brew "volta"
brew "coursier/formulas/coursier"
brew "mercurial"
brew "clojure/tools/clojure"
brew "borkdude/brew/clj-kondo"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "babashka/brew/neil"
brew "borkdude/brew/jet"
brew "guile"
brew "mlton"
brew "kerl"
brew "asdf"
# brew "chruby"       # Change ruby
# brew "ruby-install" # ruby install

# Utilities
brew "coreutils"    # GNU File, Shell and Text utilities (cat, tac, nl, base64, fmt, head, sort, ...)
brew "parallel"     # Shell command parallelization utility
brew "editorconfig" # Maintain consistent coding style between multiple editors
brew "swagger-codegen" # Generate swagger apis.

# Dev-tools
## brew "openssl@3"    # Crytography and SSL/TLS Toolkit
## brew "openssl@1.1"
# brew "docutils"
# brew "sphinx-doc" # Python dockmentation generator
# cask "aws-vault"
# cask "google-cloud-sdk"

# Graphics/Typesetters
brew "imagemagick"  # magick
cask "mactex"       # LaTeX
# brew "gdk-pixbuf" # Toolkit for image loading and pixel buffer manipulation
cask "xquartz"      # Open source X11

# MAYBE via rust-cargo???

# Compilers/Interpreters
brew "faust"            # DSL for audio processing
# cask "dotnet"           # Microsoft JRE
cask "dotnet-sdk"       # Microsoft JDK
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk6-0-400"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk7-0-400"
cask "isen-ng/dotnet-sdk-versions/dotnet-sdk8-0-100"
brew "shared-mime-info" # Shared MIME Info
brew "shivammathur/php/php"
brew "chezscheme"
cask "racket"
cask "julia"
cask "r"
brew "glslang"

# Libraries
brew "glib"
# brew "gdbm"
# brew "freetds" # Libraries to talk to Microsoft SQL Server and Sybase databases
# brew "gobject-introspection"
# brew "harfbuzz" # OpenType text shaping engine
brew "pango" # Framework for layout and rendering of i18n text
brew "cairo"
brew "libheif" # High Efficientcy Image File Format
brew "krb5" # Kerebos network authentication protocol
brew "zeromq" # High-performance, asynchronous messaging library

# EMBEDDED
# brew "arduino-cli"  # Arduino command-line insterface
# cask "raspberry-pi-imager"
# brew "apr-util"     # Companion library to apr, the Apache Portable Runtime library
# brew "avrdude"
# brew "armmbed/formulae/arm-none-eabi-gcc"
# brew "osx-cross/avr/avr-gcc@9"

# Music!
brew "fluid-synth" # Real-time software synthesizer based on the SoundFont 2 specs
brew "lilypond"     # LaTeX for music
cask "frescobaldi"
cask "simplesynth"
# cask "soundflower"    # MacOS Audio channel hacks
# cask "soundflowerbed" # Route audio channels to audio devices
cask "osculator"       # Connect MIDI and OSC
cask "touchosc"        # MIDI and OSC Controller
cask "touchosc-bridge"        # MIDI and OSC Controller
# cask "touchosc-editor"        # MIDI and OSC Controller
cask "vcv-rack"
cask "supercollider" # Livecoding Server

# IDEs & Editors
brew "neovim"
brew "neovim-qt"
brew "railwaycat/emacsmacport/emacs-mac", args: ["with-dbus", "with-emacs-big-sur-icon", "with-imagemagick", "with-librsvg", "with-native-compilation", "with-starter", "with-xwidgets"]
mas 'Xcode', id: 497799835 # Sadly, we have to
cask "visual-studio"       # For if we have to...
# cask "rider"             # IntelliJ visual-studio
# cask "clion"             # IntelliJ c
# cask "appcode"           # IntelliJ Xcode
# cask "goland"            # IntelliJ go
# cask "webstorm"          # IntelliJ js
# cask "pycharm"           # IntelliJ python
cask "arduino-ide"         # Arduino IDE!
# cask "rstudio"           # For when I don't like org anymore...

# Database Clients
# cask "dbvisualizer"      # Database management and analysis tool
# cask "mysqlworkbanch"    # Official PhpMyAdmin
# cask "popsql"            # Live PhpMyAdmin
# cask "datagrip"          # IntelliJ PhpMyAdmin
# cask "neo4j"

# Web Clients
cask "postman"
cask "postman-agent"
cask "postman-cli"
cask "firecamp"
cask "altair-graphql-client" # GraphQL client

# CAD Software
# cask "autodesk-fusion360"
# cask "cad-assistant"     # 3D viewer and converter for CAD and mesh files
# cask "free-cad"
cask "kicad"              # CAD to design circuit-boards
cask "openscad"           # Cad for emacs.
cask "prusaslicer"        # For prusa printers

# Embedded
brew "platformio"

# Terminals
brew "minicom"            # clone of the MS-DOS "Telix" communication program.
brew "fish"               # Frendly shell.
cask "warp"               # Rust based terminal
cask "powershell"         #
cask "iterm2"             # iTerm2

# VMs
cask "docker"             # Docker
# cask "parallels"
# cask "parallels-client"
# cask "parallels-virtualization-sdk"
cask "dash"               # Dash, snippets database
cask "kindle"             # Kindle ebooks reader

# Remote access viewer
cask "microsoft-remote-desktop"
# cask "teamviewer"

# Office Apps
cask "microsoft-office"
cask "libreoffice"

# Browsers
# cask "arc"              # Chromium based browser
cask "google-chrome"      # Google Chrome
cask "chromedriver"       # Google Chrome-controller for Selenium
cask "chromium"           # Google Chrome, but without identity theft...
cask "microsoft-edge"     # Microsoft Chrome
cask "opera"

# Team Communication
cask "slack"
# cask "icq"
# cask "signal"
# cask "messenger" # Facebook Messenger
# cask "discord"
cask "microsoft-teams"
